levenlai/rt-stm32/bsp/stm32f10x/ili_lcd_demo.c
static void lcd_port_init(void)
{
    LCD_FSMCConfig();
}

lcd_inline void write_cmd(unsigned short cmd)
{
    LCD_REG = cmd;
}

lcd_inline unsigned short read_data(void)
{
    return LCD_RAM;
}

lcd_inline void write_data(unsigned short data_code )
{
    LCD_RAM = data_code;
}

lcd_inline void write_reg(unsigned char reg_addr,unsigned short reg_val)
{
    LCD_REG = reg_addr;
    LCD_RAM = reg_val;
}

lcd_inline unsigned short read_reg(unsigned char reg_addr)
{
    unsigned short val=0;
    write_cmd(reg_addr);
    val = read_data();
    return (val);
}

lcd_inline void SetBackLight(BitAction enable)
{
    GPIO_WriteBit(GPIOC, GPIO_Pin_7, enable);            //LIGHT
}

/********* control <只移植以上函数即可> ***********/

static unsigned short deviceid=0;//设置一个静态变量用来保存LCD的ID

//返回LCD的ID
unsigned int lcd_getdeviceid(void)
{
    return deviceid;
}

static unsigned short BGR2RGB(unsigned short c)
{
    u16  r, g, b, rgb;

    b = (c>>0)  & 0x1f;
    g = (c>>5)  & 0x3f;
    r = (c>>11) & 0x1f;

    rgb =  (b<<11) + (g<<5) + (r<<0);

    return( rgb );
}

static void lcd_SetCursor(unsigned int x,unsigned int y)
{
    write_reg(32,x);    /* 0-239 */
    write_reg(33,y);    /* 0-319 */
}

/* 读取指定地址的GRAM */
static unsigned short lcd_read_gram(unsigned int x,unsigned int y)
{
    unsigned short temp;
    lcd_SetCursor(x,y);
    rw_data_prepare();
    /* dummy read */
    temp = read_data();
    temp = read_data();
    return temp;
}

static void lcd_clear(unsigned short Color)
{
    unsigned int index=0;
    lcd_SetCursor(0,0);
    rw_data_prepare();                      /* Prepare to write GRAM */
    for (index=0; index<(LCD_WIDTH*LCD_HEIGHT); index++)
    {
        write_data(Color);
    }
}

static void lcd_data_bus_test(void)
{
    unsigned short temp1;
    unsigned short temp2;
    /* [5:4]-ID~ID0 [3]-AM-1垂直-0水平 */
    write_reg(0x0003,(1<<12)|(1<<5)|(1<<4) | (0<<3) );

    /* wirte */
    lcd_SetCursor(0,0);
    rw_data_prepare();
    write_data(0x5555);
    write_data(0xAAAA);

    /* read */
    lcd_SetCursor(0,0);
    if (
        (deviceid ==0x9325)
        || (deviceid ==0x9328)
        || (deviceid ==0x9320)
    )
    {
        temp1 = lcd_read_gram(0, 0);//BGR2RGB( lcd_read_gram(0,0) );
        temp2 = lcd_read_gram(1,0);//BGR2RGB( lcd_read_gram(1,0) );
    }
    else if( deviceid ==0x4531 )
    {
        temp1 = lcd_read_gram(0,0);
        temp2 = lcd_read_gram(1,0);
    }

    if( (temp1 == 0x5555) && (temp2 == 0xAAAA) )
    {
        printf(" data bus test pass!\r\n");
    }
    else
    {
        printf(" data bus test error: %04X %04X\r\n",temp1,temp2);
    }
}

void lcd_Initializtion(void)
{
    int color1;
    
    lcd_port_init();
    deviceid = read_reg(0x00);

    /* deviceid check */
    if(
        (deviceid != 0x4531)
        && (deviceid != 0x7783)
        && (deviceid != 0x9320)
        && (deviceid != 0x9325)
        && (deviceid != 0x9328)
        && (deviceid != 0x9300)
    )
    {
        printf("Invalid LCD ID:%08X\r\n",deviceid);
        printf("Please check you hardware and configure.");
        //while(1);
        return ;
    }
    else
    {
        printf("\r\nLCD Device ID : %04X ",deviceid);
    }

    if(deviceid==0x9325|| deviceid==0x9328)
    {

        #if 1
        write_reg(0x00e7,0x0010);
        write_reg(0x0000,0x0001);  			        //start internal osc
#if defined(_ILI_REVERSE_DIRECTION_)
        write_reg(0x0001,0x0000);                    //Reverse Display
#else
        write_reg(0x0001,0x0100);                    //
#endif
        write_reg(0x0002,0x0700); 				    //power on sequence
        /* [5:4]-ID1~ID0 [3]-AM-1垂直-0水平 */
        write_reg(0x0003,(1<<12)|(1<<5)|(0<<4) | (1<<3) );
        write_reg(0x0004,0x0000);
        write_reg(0x0008,0x0207);
        write_reg(0x0009,0x0000);
        write_reg(0x000a,0x0000); 				//display setting
        write_reg(0x000c,0x0001);				//display setting
        write_reg(0x000d,0x0000); 				//0f3c
        write_reg(0x000f,0x0000);
        //Power On sequence //
        write_reg(0x0010,0x0000);
        write_reg(0x0011,0x0007);
        write_reg(0x0012,0x0000);
        write_reg(0x0013,0x0000);
        rt_thread_delay(1);
        write_reg(0x0010,0x1590);
        write_reg(0x0011,0x0227);
        rt_thread_delay(1);
        write_reg(0x0012,0x009c);
        rt_thread_delay(1);
        write_reg(0x0013,0x1900);
        write_reg(0x0029,0x0023);
        write_reg(0x002b,0x000e);
        rt_thread_delay(1);
        write_reg(0x0020,0x0000);
        write_reg(0x0021,0x0000);
        rt_thread_delay(1);
        write_reg(0x0030,0x0007);
        write_reg(0x0031,0x0707);
        write_reg(0x0032,0x0006);
        write_reg(0x0035,0x0704);
        write_reg(0x0036,0x1f04);
        write_reg(0x0037,0x0004);
        write_reg(0x0038,0x0000);
        write_reg(0x0039,0x0706);
        write_reg(0x003c,0x0701);
        write_reg(0x003d,0x000f);
        rt_thread_delay(1);
        write_reg(0x0050,0x0000);
        write_reg(0x0051,0x00ef);
        write_reg(0x0052,0x0000);
        write_reg(0x0053,0x013f);
#if defined(_ILI_REVERSE_DIRECTION_)
        write_reg(0x0060,0x2700);
#else
        write_reg(0x0060,0xA700);
#endif
        write_reg(0x0061,0x0001);
        write_reg(0x006a,0x0000);
        write_reg(0x0080,0x0000);
        write_reg(0x0081,0x0000);
        write_reg(0x0082,0x0000);
        write_reg(0x0083,0x0000);
        write_reg(0x0084,0x0000);
        write_reg(0x0085,0x0000);
        write_reg(0x0090,0x0010);
        write_reg(0x0092,0x0000);
        write_reg(0x0093,0x0003);
        write_reg(0x0095,0x0110);
        write_reg(0x0097,0x0000);
        write_reg(0x0098,0x0000);
        //display on sequence
        write_reg(0x0007,0x0133);
        write_reg(0x0020,0x0000);
        write_reg(0x0021,0x0000);
        #else
        write_reg(0x00E3, 0x3008); // Set internal timing
        write_reg(0x00E7, 0x0012); // Set internal timing
        write_reg(0x00EF, 0x1231); // Set internal timing
        write_reg(0x0000, 0x0100); // Start Oscillation
        write_reg(0x0001, 0x0100); // set SS and SM bit
        write_reg(0x0002, 0x0700); // set 1 line inversion

        write_reg(0x0003, 0x10b0); // set GRAM write direction and BGR=0,262K colors,1 transfers/pixel.
        write_reg(0x0004, 0x0000); // Resize register
        write_reg(0x0008, 0x0202); // set the back porch and front porch
        write_reg(0x0009, 0x0000); // set non-display area refresh cycle ISC[3:0]
        write_reg(0x000A, 0x0001); // FMARK function
        write_reg(0x000C, 0x0000); // RGB interface setting
        write_reg(0x000D, 0x0000); // Frame marker Position
        write_reg(0x000F, 0x0000); // RGB interface polarity
        //Power On sequence 
        write_reg(0x0010, 0x1590); // SAP, BT[3:0], AP, DSTB, SLP, STB
        write_reg(0x0011, 0x0007); // DC1[2:0], DC0[2:0], VC[2:0]
        write_reg(0x0012, 0x0000); // VREG1OUT voltage
        write_reg(0x0013, 0x0000); // VDV[4:0] for VCOM amplitude
        rt_thread_delay(5); // Dis-charge capacitor power voltage
        write_reg(0x0010, 0x1690); // SAP, BT[3:0], AP, DSTB, SLP, STB
        write_reg(0x0011, 0x0227); // R11h=0x0221 at VCI=3.3V, DC1[2:0], DC0[2:0], VC[2:0]
        rt_thread_delay(5); // Delay 50ms
        write_reg(0x0012, 0x001C); // External reference voltage= Vci;
        rt_thread_delay(5); // Delay 50ms
        write_reg(0x0013, 0x1800); // R13=1200 when R12=009D;VDV[4:0] for VCOM amplitude
        write_reg(0x0029, 0x001C); // R29=000C when R12=009D;VCM[5:0] for VCOMH
        write_reg(0x002B, 0x000D); // Frame Rate = 91Hz
        rt_thread_delay(5); // Delay 50ms
        write_reg(0x0020, 0x0000); // GRAM horizontal Address
        write_reg(0x0021, 0x0000); // GRAM Vertical Address
        // ----------- Adjust the Gamma Curve ----------//

        write_reg(0x0030, 0x0203);
        write_reg(0x0031, 0x080F);
        write_reg(0x0032, 0x0401);
        write_reg(0x0033, 0x050B);
        write_reg(0x0034, 0x3330);
        write_reg(0x0035, 0x0B05);
        write_reg(0x0036, 0x0005);
        write_reg(0x0037, 0x0F08);
        write_reg(0x0038, 0x0302);
        write_reg(0x0039, 0x3033);
        //---------------- Set GRAM area ---------------//
        write_reg(0x0050, 0x0000); // Horizontal GRAM Start Address
        write_reg(0x0051, 0x00EF); // Horizontal GRAM End Address
        write_reg(0x0052, 0x0000); // Vertical GRAM Start Address
        write_reg(0x0053, 0x013F); // Vertical GRAM Start Address
        write_reg(0x0060, 0xA700); // Gate Scan Line
        write_reg(0x0061, 0x0001); // NDL,VLE, REV
        write_reg(0x006A, 0x0000); // set scrolling line
        //-------------- Partial Display Control ---------//
        write_reg(0x0080, 0x0000);
        write_reg(0x0081, 0x0000);
        write_reg(0x0082, 0x0000);
        write_reg(0x0083, 0x0000);
        write_reg(0x0084, 0x0000);
        write_reg(0x0085, 0x0000);
        //-------------- Panel Control -------------------//
        write_reg(0x0090, 0x0010);
        write_reg(0x0092, 0x0000);
        write_reg(0x0093, 0x0003);
        write_reg(0x0095, 0x0110);
        write_reg(0x0097, 0x0000);
        write_reg(0x0098, 0x0000);
        write_reg(0x0007, 0x0133); // 262K color and display ON

